app/views/users/show.html.erb

SELECT  1 AS one FROM "reminders" WHERE "reminders"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
  <div class="col-md-4">
    <% if @user.reminders.any? %>