app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "reminders" WHERE "reminders"."user_id" = ?  [["user_id", 1]]
---
<span><%= link_to "Listar memos", current_user %></span>
<span><%= pluralize(current_user.reminders.count, "recordatorios") %></span>