app/controllers/reminders_controller.rb

INSERT INTO "reminders" ("content", "when_activate", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "djdsadjasdasj"], ["when_activate", "2015-01-01 00:00:00.000000"], ["user_id", 1], ["created_at", "2015-12-18 22:55:32.678848"], ["updated_at", "2015-12-18 22:55:32.678848"]]
---
  def create
    @reminder = current_user.reminders.build(reminder_params)
    if @reminder.save

DELETE FROM "reminders" WHERE "reminders"."id" = ?  [["id", 3]]
---
  def destroy
    @reminder.destroy