app/controllers/static_pages_controller.rb

  def home
    if logged_in?
      @reminder = current_user.reminders.build
      @feed_items = current_user.feed.paginate(page: params[:page])
---
SELECT  "reminders".* FROM "reminders" WHERE (user_id = 1)  ORDER BY "reminders"."created_at" DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "reminders" WHERE "reminders"."user_id" = ?  [["user_id", 1]]