app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reminders".* FROM "reminders" WHERE "reminders"."user_id" = ?  ORDER BY "reminders"."created_at" DESC LIMIT 30 OFFSET 0  [["user_id", 1]]
SELECT COUNT(*) FROM "reminders" WHERE "reminders"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @reminders = @user.reminders.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "mobile_num", "password_digest", "created_at", "updated_at", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "mobile_num" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["mobile_num", "56964257821"], ["updated_at", "2016-02-25 20:42:48.955526"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)